### Add/Remove Rows and Columns From DataFrames

In [170]:
people = {
    'first': ['Corey', 'Jane', 'John'], 
    'last': ['Schafer', 'Doe', 'Doe'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [171]:
import pandas as pd

In [172]:
df = pd.DataFrame(people)

In [173]:
df["first"] + " " + df["last"]

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [174]:
df["full_name"] = df["first"] + " " + df["last"]
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [175]:
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [176]:
df["full_name"] = df.apply(lambda x: f"{x['first']} {x['last']}", axis=1)

In [177]:
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [178]:
df.drop(columns = ["first", "last"], inplace=True)

In [179]:
#splitting full_name column to first and last 
df["full_name"].str.split(" ", expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [180]:
df[["first", "last"]] = df["full_name"].str.split(" ", expand=True)

In [181]:

df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [182]:
new_row = {"first":["Tony"]}
df0 = pd.DataFrame(new_row)
df = pd.concat([df, df0], ignore_index=True)

In [183]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN

In [184]:
new_row = {"first" : "Faraz"}

df.loc[len(df)] = new_row

In [185]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN
4                      NaN            NaN  Faraz      NaN

In [186]:
people = {
    'first': ['Tony', 'Steve'], 
    'last': ['Stark', 'Rogers'], 
    'email': ['IronMan@avenge.com', 'Cap@avenge.com']
}

df2 = pd.DataFrame(people)

In [187]:
df2

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [188]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN
4                      NaN            NaN  Faraz      NaN

In [191]:
df = pd.concat([df, df2], ignore_index=True, axis=0)
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN
4                      NaN            NaN  Faraz      NaN
5       IronMan@avenge.com            NaN   Tony    Stark
6           Cap@avenge.com            NaN  Steve   Rogers
7       IronMan@avenge.com            NaN   Tony    Stark
8           Cap@avenge.com            NaN  Steve   Rogers

In [193]:
df.drop(index=[3,4], inplace=True)

In [194]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
5       IronMan@avenge.com            NaN   Tony    Stark
6           Cap@avenge.com            NaN  Steve   Rogers
7       IronMan@avenge.com            NaN   Tony    Stark
8           Cap@avenge.com            NaN  Steve   Rogers

In [196]:
filt = df["last"]=="Doe"

df.drop(index = df[filt].index, inplace=True)

In [197]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
5       IronMan@avenge.com            NaN   Tony    Stark
6           Cap@avenge.com            NaN  Steve   Rogers
7       IronMan@avenge.com            NaN   Tony    Stark
8           Cap@avenge.com            NaN  Steve   Rogers